* DONE Finish labeling issues 
  CLOCK: [2015-05-04 Mon 13:28]--[2015-05-04 Mon 14:02] =>  0:34
* DONE Add 'Cleanup' label (can't believe I missed it)  
* TODO Finish getting mass issue thing ready
  CLOCK: [2015-05-05 Tue 20:43]
  CLOCK: [2015-05-04 Mon 20:57]--[2015-05-04 Mon 20:57] =>  0:00
  CLOCK: [2015-05-04 Mon 15:50]--[2015-05-04 Mon 20:57] =>  5:07
* TODO Look over Jennifer Walkers stuff
  CLOCK: [2015-04-15 Wed 10:24]--[2015-04-15 Wed 10:31] =>  0:07
* TODO Look over netsuite

** Chad
** DONE Assign all customers


** Yvonne

** TODO Forecast Type -remove

** TODO Opportunity 

** TODO Try to add Cost next to Sales Price

** TODO Find out what 'exclude from rate request'

** TODO Non-default available in the customer center

** TODO Maybe make it responsive

** TODO Workflow

   
** Kevin

** TODO Per foot price on Cable
   
* TODO Look over contract 

* TODO rebuild onping fix issues 
  CLOCK: [2015-05-05 Tue 16:09]--[2015-05-05 Tue 20:43] =>  4:34

